openthread/openthread/third_party/ti/devices/cc26x0/inc/hw_aux_wuc.h
// Field:     [0] DISCONNECT_ACK
//
// Acknowledges reception of the bus disconnection request, by matching the
// value of MCUBUSCTL.DISCONNECT_REQ.
//
// Note that if AON_WUC:AUXCTL.AUX_FORCE_ON = 1 a reconnect to the MCU domain
// bus will be made regardless of the state of MCUBUSCTL.DISCONNECT_REQ
#define AUX_WUC_MCUBUSSTAT_DISCONNECT_ACK                           0x00000001
#define AUX_WUC_MCUBUSSTAT_DISCONNECT_ACK_BITN                               0
#define AUX_WUC_MCUBUSSTAT_DISCONNECT_ACK_M                         0x00000001
#define AUX_WUC_MCUBUSSTAT_DISCONNECT_ACK_S                                  0

//*****************************************************************************
//
// Register: AUX_WUC_O_AONCTLSTAT
//
//*****************************************************************************
// Field:     [1] AUX_FORCE_ON
//
// Status of AON_WUC:AUX_CTL.AUX_FORCE_ON.
#define AUX_WUC_AONCTLSTAT_AUX_FORCE_ON                             0x00000002
#define AUX_WUC_AONCTLSTAT_AUX_FORCE_ON_BITN                                 1
#define AUX_WUC_AONCTLSTAT_AUX_FORCE_ON_M                           0x00000002
#define AUX_WUC_AONCTLSTAT_AUX_FORCE_ON_S                                    1

// Field:     [0] SCE_RUN_EN
//
// Status of AON_WUC:AUX_CTL.SCE_RUN_EN.
#define AUX_WUC_AONCTLSTAT_SCE_RUN_EN                               0x00000001
#define AUX_WUC_AONCTLSTAT_SCE_RUN_EN_BITN                                   0
#define AUX_WUC_AONCTLSTAT_SCE_RUN_EN_M                             0x00000001
#define AUX_WUC_AONCTLSTAT_SCE_RUN_EN_S                                      0

//*****************************************************************************
//
// Register: AUX_WUC_O_AUXIOLATCH
//
//*****************************************************************************
// Field:     [0] EN
//
// Opens (1) or closes (0) the AUX_AIODIO0/AUX_AIODIO1 signal latching.
//
// At startup, set EN = TRANSP before configuring AUX_AIODIO0/AUX_AIODIO1 and
// subsequently selecting AUX mode in the AON_IOC.
//
// When powering off the AUX domain (using PWROFFREQ.REQ), set EN = STATIC in
// advance preserve the current state (mode and output value) of the I/O pins.
// ENUMs:
// TRANSP                   Latches are transparent ( open )
// STATIC                   Latches are static ( closed )
#define AUX_WUC_AUXIOLATCH_EN                                       0x00000001
#define AUX_WUC_AUXIOLATCH_EN_BITN                                           0
#define AUX_WUC_AUXIOLATCH_EN_M                                     0x00000001
#define AUX_WUC_AUXIOLATCH_EN_S                                              0
#define AUX_WUC_AUXIOLATCH_EN_TRANSP                                0x00000001
#define AUX_WUC_AUXIOLATCH_EN_STATIC                                0x00000000

//*****************************************************************************
//
// Register: AUX_WUC_O_MODCLKEN1
//
//*****************************************************************************
// Field:     [7] AUX_ADI4
//
// Enables (1) or disables (0) clock for AUX_ADI4.
// ENUMs:
// EN                       AUX_SCE has requested clock for AUX_ADI4
// DIS                      AUX_SCE has not requested clock for AUX_ADI4
#define AUX_WUC_MODCLKEN1_AUX_ADI4                                  0x00000080
#define AUX_WUC_MODCLKEN1_AUX_ADI4_BITN                                      7
#define AUX_WUC_MODCLKEN1_AUX_ADI4_M                                0x00000080
#define AUX_WUC_MODCLKEN1_AUX_ADI4_S                                         7
#define AUX_WUC_MODCLKEN1_AUX_ADI4_EN                               0x00000080
#define AUX_WUC_MODCLKEN1_AUX_ADI4_DIS                              0x00000000

// Field:     [6] AUX_DDI0_OSC
//
// Enables (1) or disables (0) clock for AUX_DDI0_OSC.
// ENUMs:
// EN                       AUX_SCE has requested clock for AUX_DDI0_OSC
// DIS                      AUX_SCE has not requested clock for AUX_DDI0_OSC
#define AUX_WUC_MODCLKEN1_AUX_DDI0_OSC                              0x00000040
#define AUX_WUC_MODCLKEN1_AUX_DDI0_OSC_BITN                                  6
#define AUX_WUC_MODCLKEN1_AUX_DDI0_OSC_M                            0x00000040
#define AUX_WUC_MODCLKEN1_AUX_DDI0_OSC_S                                     6
#define AUX_WUC_MODCLKEN1_AUX_DDI0_OSC_EN                           0x00000040
#define AUX_WUC_MODCLKEN1_AUX_DDI0_OSC_DIS                          0x00000000

// Field:     [4] ANAIF
//
// Enables (1) or disables (0) clock for AUX_ANAIF.
// ENUMs:
// EN                       AUX_SCE has requested clock for ANAIF
// DIS                      AUX_SCE has not requested clock for ANAIF
#define AUX_WUC_MODCLKEN1_ANAIF                                     0x00000010
#define AUX_WUC_MODCLKEN1_ANAIF_BITN                                         4
#define AUX_WUC_MODCLKEN1_ANAIF_M                                   0x00000010
#define AUX_WUC_MODCLKEN1_ANAIF_S                                            4
#define AUX_WUC_MODCLKEN1_ANAIF_EN                                  0x00000010
#define AUX_WUC_MODCLKEN1_ANAIF_DIS                                 0x00000000

// Field:     [3] TIMER
//
// Enables (1) or disables (0) clock for AUX_TIMER.
// ENUMs:
// EN                       AUX_SCE has requested clock for TIMER
// DIS                      AUX_SCE has not requested clock for TIMER
#define AUX_WUC_MODCLKEN1_TIMER                                     0x00000008
#define AUX_WUC_MODCLKEN1_TIMER_BITN                                         3
#define AUX_WUC_MODCLKEN1_TIMER_M                                   0x00000008
#define AUX_WUC_MODCLKEN1_TIMER_S                                            3
#define AUX_WUC_MODCLKEN1_TIMER_EN                                  0x00000008
#define AUX_WUC_MODCLKEN1_TIMER_DIS                                 0x00000000

// Field:     [2] AIODIO1
//
// Enables (1) or disables (0) clock for AUX_AIODIO1.
// ENUMs:
// EN                       AUX_SCE has requested clock for AIODIO1
// DIS                      AUX_SCE has not requested clock for AIODIO1
#define AUX_WUC_MODCLKEN1_AIODIO1                                   0x00000004
#define AUX_WUC_MODCLKEN1_AIODIO1_BITN                                       2
#define AUX_WUC_MODCLKEN1_AIODIO1_M                                 0x00000004
#define AUX_WUC_MODCLKEN1_AIODIO1_S                                          2
#define AUX_WUC_MODCLKEN1_AIODIO1_EN                                0x00000004
#define AUX_WUC_MODCLKEN1_AIODIO1_DIS                               0x00000000

// Field:     [1] AIODIO0
//
// Enables (1) or disables (0) clock for AUX_AIODIO0.
// ENUMs:
// EN                       AUX_SCE has requested clock for AIODIO0
// DIS                      AUX_SCE has not requested clock for AIODIO0
#define AUX_WUC_MODCLKEN1_AIODIO0                                   0x00000002
#define AUX_WUC_MODCLKEN1_AIODIO0_BITN                                       1
#define AUX_WUC_MODCLKEN1_AIODIO0_M                                 0x00000002
#define AUX_WUC_MODCLKEN1_AIODIO0_S                                          1
#define AUX_WUC_MODCLKEN1_AIODIO0_EN                                0x00000002
#define AUX_WUC_MODCLKEN1_AIODIO0_DIS                               0x00000000

// Field:     [0] SMPH
//
// Enables (1) or disables (0) clock for AUX_SMPH.
// ENUMs:
// EN                       AUX_SCE has requested clock for SMPH
// DIS                      AUX_SCE has not requested clock for SMPH
#define AUX_WUC_MODCLKEN1_SMPH                                      0x00000001
#define AUX_WUC_MODCLKEN1_SMPH_BITN                                          0
#define AUX_WUC_MODCLKEN1_SMPH_M                                    0x00000001
#define AUX_WUC_MODCLKEN1_SMPH_S                                             0
#define AUX_WUC_MODCLKEN1_SMPH_EN                                   0x00000001
#define AUX_WUC_MODCLKEN1_SMPH_DIS                                  0x00000000


#endif // __AUX_WUC__
